app/controllers/flights_controller.rb

  def getflights

    origin = params[:origin];
    destination = params[:destination];

    @searched_flights = Flight.where origin: params[:origin].downcase, destination: params[:destination].downcase
---
SELECT  "flights".* FROM "flights" WHERE "flights"."origin" = $1 AND "flights"."destination" = $2 LIMIT $3  [["origin", "sydney"], ["destination", "melbourne"], ["LIMIT", 1]]

  def show
    @flight = Flight.find params[:id]
    @plane = Plane.find @flight.plane_id
    @reservations = Reservation.where flight_id: params[:id]
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "planes".* FROM "planes" WHERE "planes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."flight_id" = $1  [["flight_id", 1]]

  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save
---
INSERT INTO "flights" ("flight_number", "origin", "destination", "date", "plane_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @flight.destroy
---
DELETE FROM "flights" WHERE "flights"."id" = $1  [["id", 1]]