app/controllers/flights_controller.rb

  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save
---
INSERT INTO "flights" ("flight_number", "origin", "destination", "date", "plane_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @flight.destroy
---
DELETE FROM "flights" WHERE "flights"."id" = $1  [["id", 1]]