app/controllers/planes_controller.rb

  def create
    @plane = Plane.new(plane_params)

    respond_to do |format|
      if @plane.save
---
INSERT INTO "planes" ("num_seats", "seats", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["num_seats", 10], ["seats", "[1A, 1B, 1C]"], ["name", "747"], ["created_at", "2020-01-29 08:43:23.152929"], ["updated_at", "2020-01-29 08:43:23.152929"]]

  def update
    respond_to do |format|
      if @plane.update(plane_params)
---
UPDATE "planes" SET "seats" = $1, "updated_at" = $2 WHERE "planes"."id" = $3  [["seats", "1A 1B 1C"], ["updated_at", "2020-01-29 08:44:03.440293"], ["id", 1]]

    def set_plane
      @plane = Plane.find(params[:id])
---
SELECT  "planes".* FROM "planes" WHERE "planes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]