app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "test"], ["LIMIT", 1]]
---
    def create
        user = User.find_by(name:login_params[:name])