app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["password_digest", "$2a$12$9u2wt5w5BFcECbFj62l8nONDn.oqsmscpfD2zoAOWHiLmSxTmZZ.2"], ["created_at", "2020-01-29 07:22:59.760754"], ["updated_at", "2020-01-29 07:22:59.760754"]]
---
    def create
        @user = User.new(user_params)

        respond_to do |format|
          if @user.save