app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "admin"], ["created_at", "2020-01-30 01:07:47.425945"], ["updated_at", "2020-01-30 01:07:47.425945"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save